{
  "page": {
    "contentPageHeader": {
      "summary": "Minister for Law and Second Minister for Home Affairs",
      "showThumbnail": false
    },
    "title": "Mr Edwin TONG",
    "permalink": "/pmo-speed-run/mr-edwin-tong",
    "lastModified": "2025-09-09T13:04:58.078Z",
    "image": {
      "alt": "Portrait of Mr Edwin TONG, Minister for Law and Second Minister for Home Affairs",
      "src": "/images/the-cabinet/updated/edwin-tong.jpg"
    }
  },
  "layout": "content",
  "content": [
    {
      "type": "contentpic",
      "content": {
        "type": "prose",
        "content": [
          {
            "type": "paragraph",
            "attrs": {
              "dir": "ltr"
            },
            "content": [
              {
                "type": "text",
                "marks": [
                  {
                    "type": "bold"
                  }
                ],
                "text": "Mr Edwin Tong SC "
              },
              {
                "type": "text",
                "text": "was appointed Minister for Law and Second Minister for Home Affairs on 23 May 2025. Prior to this, he served as Minister for Culture, Community and Youth, and Second Minister for Law from 2020 to 2025, and as Senior Minister of State at the Ministry of Law and the Ministry of Health from 2018 to 2020. He currently serves as Deputy Chairman of the People’s Association, a position he has held since 2021."
              }
            ]
          }
        ]
      },
      "imageAlt": "Portrait of Mr Edwin TONG, Minister for Law and Second Minister for Home Affairs",
      "imageSrc": "/images/the-cabinet/updated/edwin-tong.jpg"
    },
    {
      "type": "prose",
      "content": [
        {
          "type": "paragraph",
          "attrs": {
            "dir": "ltr"
          },
          "content": [
            {
              "type": "text",
              "text": "As Minister for Law, Mr Tong drives policies and initiatives to uphold the rule of law, strengthen Singapore’s legal framework, and advance access to justice. He is also responsible for policies to enhance Singapore’s legal industry and contributing to a stable society and a vibrant economy. He also champions Singapore’s development as an international hub for legal services, dispute resolution, intellectual property, as well as restructuring and insolvency."
            }
          ]
        },
        {
          "type": "paragraph",
          "attrs": {
            "dir": "ltr"
          },
          "content": [
            {
              "type": "text",
              "text": "At the Ministry of Home Affairs, he oversees critical functions, including internal security, law enforcement, civil defence, immigration, and counter-terrorism, to safeguard the safety and security of Singapore and its people."
            }
          ]
        },
        {
          "type": "paragraph",
          "attrs": {
            "dir": "ltr"
          },
          "content": [
            {
              "type": "text",
              "text": "During his tenure as Minister for Culture, Community and Youth, Mr Tong spearheaded efforts to build a caring, cohesive and confident society in Singapore, through sports, arts, heritage, religion, and youth engagement. He continues to strengthen and connect communities in his current role at the People’s Association."
            }
          ]
        },
        {
          "type": "paragraph",
          "attrs": {
            "dir": "ltr"
          },
          "content": [
            {
              "type": "text",
              "text": "At the Ministry of Health, he contributed significantly to enhancing public health measures, reviewed and improved healthcare financing and improving the transparency, accountability and certainty in the disciplinary processes for registered medical practitioners."
            }
          ]
        },
        {
          "type": "paragraph",
          "attrs": {
            "dir": "ltr"
          },
          "content": [
            {
              "type": "text",
              "text": "Before entering public service, Mr Tong spent his entire professional career at Allen & Gledhill LLP, one of Singapore’s largest law firms. He held concurrent leadership roles as Head of the Restructuring and Corporate Insolvency Department, Co-Head of the Litigation & Dispute Resolution Department, and member of the Executive Committee. Widely acknowledged to be a leading lawyer of the Singapore Bar, he was appointed Senior Counsel in 2015."
            }
          ]
        },
        {
          "type": "paragraph",
          "attrs": {
            "dir": "ltr"
          },
          "content": [
            {
              "type": "text",
              "text": "Mr Tong was first elected to Parliament in 2011 and has served as Member of Parliament for Joo Chiat Division, now part of the East Coast Group Representation Constituency, since 2015."
            }
          ]
        },
        {
          "type": "paragraph",
          "attrs": {
            "dir": "ltr"
          },
          "content": [
            {
              "type": "text",
              "text": "He was educated at St Joseph’s Institution and Raffles Junior College, before reading law at the National University of Singapore. He is married with three daughters."
            }
          ]
        }
      ]
    }
  ],
  "version": "0.1.0"
}